Sub-IoT/Sub-IoT-Stack/OLD/d7aoss/hal/msp430/driverlib/5xx_6xx/rtc.c
    HWREG(baseAddress + OFS_RTCCTL01) &= 0xF0FF; //~(RTCSSEL_3 + RTCTEV_3);
    HWREG(baseAddress + OFS_RTCCTL01) |= clockSelect + counterSizeSelect;
}

//*****************************************************************************
//
//! Initializes the settings to operate the RTC in Calendar mode.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param CalendarTime is the structure containing the values for the Calendar
//!       to be intiialized to.
//!        Valid values should be of type Calendar and should contain the
//!        following members and corresponding values:
//!        \b Seconds between 0-59
//!        \b Minutes between 0-59
//!        \b Hours between 0-24
//!        \b DayOfWeek between 0-6
//!        \b DayOfMonth between 0-31
//!        \b Year between 0-4095
//!        NOTE: Values beyond the ones specified may result in eradic behavior.
//! \param formatSelect is the format for the Calendar registers to use.
//!        Valid values are
//!        \b RTC_FORMAT_BINARY [Default]
//!        \b RTC_FORMAT_BCD
//!        Modified bits are \b RTCBCD of \b RTCCTL1 register.
//!
//! This function initializes the Calendar mode of the RTC module. In an RTC_A
//! module this mode automatically sets the clock source to ACLK and initializes
//! the prescaler sources and dividers.
//!
//! \return None
//
//*****************************************************************************
void RTC_calendarInit (unsigned int baseAddress,
    Calendar CalendarTime,
    unsigned int formatSelect)
{
    HWREGB(baseAddress + OFS_RTCCTL01_H) |= RTCMODE_H + RTCHOLD;

    HWREG(baseAddress + OFS_RTCCTL01) &= ~(RTCBCD);
    HWREG(baseAddress + OFS_RTCCTL01) |= formatSelect;

    HWREGB(baseAddress + OFS_RTCTIM0_L) = CalendarTime.Seconds;
    HWREGB(baseAddress + OFS_RTCTIM0_H) = CalendarTime.Minutes;
    HWREGB(baseAddress + OFS_RTCTIM1_L) = CalendarTime.Hours;
    HWREGB(baseAddress + OFS_RTCTIM1_H) = CalendarTime.DayOfWeek;
    HWREGB(baseAddress + OFS_RTCDATE_L) = CalendarTime.DayOfMonth;
    HWREGB(baseAddress + OFS_RTCDATE_H) = CalendarTime.Month;
    HWREG(baseAddress + OFS_RTCYEAR) = CalendarTime.Year;
}

//*****************************************************************************
//
//! Returns the Calendar Time stored in the Calendar registers of the RTC.
//!
//! \param baseAddress is the base address of the RTC module.
//!
//! This function returns the current Calendar time in the form of a Calendar
//! structure.
//!
//! \return A Calendar structure containing the current time.
//
//*****************************************************************************
Calendar RTC_getCalendarTime (unsigned int baseAddress)
{
    Calendar tempCal;

    while ( !(HWREG(baseAddress + OFS_RTCCTL01) & RTCRDY) ) ;

    tempCal.Seconds    = HWREGB(baseAddress + OFS_RTCTIM0_L);
    tempCal.Minutes    = HWREGB(baseAddress + OFS_RTCTIM0_H);
    tempCal.Hours      = HWREGB(baseAddress + OFS_RTCTIM1_L);
    tempCal.DayOfWeek  = HWREGB(baseAddress + OFS_RTCTIM1_H);
    tempCal.DayOfMonth = HWREGB(baseAddress + OFS_RTCDATE_L);
    tempCal.Month      = HWREGB(baseAddress + OFS_RTCDATE_H);
    tempCal.Year       = HWREG(baseAddress + OFS_RTCYEAR);

    return ( tempCal) ;
}

//*****************************************************************************
//
//! Sets and Enables the desired Calendar Alarm settings.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param minutesAlarm is the alarm condition for the minutes.
//!        Valid values are
//!        \b An integer between 0-59, OR
//!        \b RTC_ALARMCONDITION_OFF [Default]
//! \param hoursAlarm is the alarm condition for the hours.
//!        Valid values are
//!        \b An integer between 0-24, OR
//!        \b RTC_ALARMCONDITION_OFF [Default]
//! \param dayOfWeekAlarm is the alarm condition for the day of week.
//!        Valid values are
//!        \b An integer between 0-6, OR
//!        \b RTC_ALARMCONDITION_OFF [Default]
//! \param dayOfMonthAlarm is the alarm condition for the day of the month.
//!        Valid values are
//!        \b An integer between 0-31, OR
//!        \b RTC_ALARMCONDITION_OFF [Default]
//!
//! This function sets a Calendar interrupt condition to assert the RTCAIFG
//! interrupt flag. The condition is a logical and of all of the parameters.
//! For example if the minutes and hours alarm is set, then the interrupt will
//! only assert when the minutes AND the hours change to the specified setting.
//! Use the RTC_ALARM_OFF for any alarm settings that should not be apart of the
//! alarm condition.
//!
//! \return None
//
//*****************************************************************************
void RTC_setCalendarAlarm (unsigned int baseAddress,
    unsigned char minutesAlarm,
    unsigned char hoursAlarm,
    unsigned char dayOfWeekAlarm,
    unsigned char dayOfMonthAlarm)
{
    //Each of these is XORed with 0x80 to turn on if an integer is passed,
    //or turn OFF if RTC_ALARM_OFF (0x80) is passed.
    HWREGB(baseAddress + OFS_RTCAMINHR_L) = (minutesAlarm ^ 0x80);
    HWREGB(baseAddress + OFS_RTCAMINHR_H) = (hoursAlarm ^ 0x80);
    HWREGB(baseAddress + OFS_RTCADOWDAY_L) = (dayOfWeekAlarm ^ 0x80);
    HWREGB(baseAddress + OFS_RTCADOWDAY_H) = (dayOfMonthAlarm ^ 0x80);
}

//*****************************************************************************
//
//! Sets a single specified Calendar interrupt condition.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param eventSelect is the condition selected.
//!        Valid values are
//!        \b RTC_CALENDAREVENT_MINUTECHANGE - assert interrupt on every minute
//!        \b RTC_CALENDAREVENT_HOURCHANGE - assert interrupt on every hour
//!        \b RTC_CALENDAREVENT_NOON - assert interrupt when hour is 12
//!        \b RTC_CALENDAREVENT_MIDNIGHT - assert interrupt when hour is 0
//!        Modified bits are \b RTCTEV of \b RTCCTL register.
//!
//! This function sets a specified event to assert the RTCTEVIFG interrupt. This
//! interrupt is independent from the Calendar alarm interrupt.
//!
//! \return None
//
//*****************************************************************************
void RTC_setCalendarEvent (unsigned int baseAddress,
    unsigned int eventSelect)
{
    HWREG(baseAddress + OFS_RTCCTL01) &= ~(RTCTEV_3); //Reset bits
    HWREG(baseAddress + OFS_RTCCTL01) |= eventSelect;
}

//*****************************************************************************
//
//! Returns the value of the Counter register (RTC_A ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//!
//! This function returns the value of the counter register for the RTC_A module.
//! It will return the 32-bit value no matter the size set during initialization.
//! The RTC should be held before trying to use this function.
//!
//! \return The raw value of the full 32-bit Counter Register.
//
//*****************************************************************************
unsigned long RTC_getCounterValue (unsigned int baseAddress)
{
    if ( (HWREGB(baseAddress + OFS_RTCCTL01_H) & RTCHOLD_H)
         || (HWREGB(baseAddress + OFS_RTCPS1CTL) & RT1PSHOLD) ){
        return ( 0) ;
    }

    unsigned long counterValue_L = HWREG(baseAddress + OFS_RTCTIM0);
    unsigned long counterValue_H = HWREG(baseAddress + OFS_RTCTIM1);
    return ( (counterValue_H << 16) + counterValue_L );
}

//*****************************************************************************
//
//! Sets the value of the Counter register (RTC_A ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//! \param counterValue is the value to set the Counter register to; a valid
//!       value may be any 32-bit integer.
//!
//! This function sets the counter register of the RTC_A module.
//!
//! \return None
//
//*****************************************************************************
void RTC_setCounterValue (unsigned int baseAddress,
    unsigned long counterValue)
{
    HWREG(baseAddress + OFS_RTCTIM0) = counterValue;
    HWREG(baseAddress + OFS_RTCTIM1) = ( counterValue >> 16 );
}

//*****************************************************************************
//
//! Initializes the Prescaler for Counter mode (RTC_A ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//! \param prescaleSelect is the prescaler to initialize.
//!        Valid values are
//!        \b RTC_PRESCALE_0
//!        \b RTC_PRESCALE_1
//! \param prescaleClockSelect is the clock to drive the selected prescaler.
//!        Valid values are
//!        \b RTC_CLOCKSELECT_ACLK [Default]
//!        \b RTC_CLOCKSELECT_SMCLK
//!        \b RTC_CLOCKSELECT_RT0PS - use Prescaler 0 as source to Prescaler 1
//!             (May only be used if prescaleSelect is RTC_PRESCALE_1)
//!        Modified bits are \b RTxSSEL of \b RTCPSxCTL register.
//! \param prescaleDivider is the divider for the selected clock source.
//!        Valid values are
//!        \b RTC_PSDIVIDER_2 [Default]
//!        \b RTC_PSDIVIDER_4
//!        \b RTC_PSDIVIDER_8
//!        \b RTC_PSDIVIDER_16
//!        \b RTC_PSDIVIDER_32
//!        \b RTC_PSDIVIDER_64
//!        \b RTC_PSDIVIDER_128
//!        \b RTC_PSDIVIDER_256
//!        Modified bits are \b RTxPSDIV of \b RTCPSxCTL register.
//!
//! This function initializes the selected prescaler for the counter mode in the
//! RTC_A module. If the RTC is initialized in Calendar mode, then these are
//! automatically initialized. The Prescalers can be used to divide a clock
//! source additionally before it gets to the main RTC clock.
//!
//! \return None
//
//*****************************************************************************
void RTC_counterPrescaleInit (unsigned int baseAddress,
    unsigned char prescaleSelect,
    unsigned int prescaleClockSelect,
    unsigned int prescaleDivider)
{
    //Reset bits and set clock select
    HWREG(baseAddress + OFS_RTCPS0CTL + prescaleSelect) =
        prescaleClockSelect + prescaleDivider;
}

//*****************************************************************************
//
//! Holds the selected Prescaler (RTC_A ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//! \param prescaleSelect is the prescaler to hold.
//!        Valid values are
//!        \b RTC_PRESCALE_0
//!        \b RTC_PRESCALE_1
//!
//! This function holds the prescale counter from continuing. This will only
//! work in counter mode, in Calendar mode, the RTC_holdClock() must be used.
//! In counter mode, if using both prescalers in conjunction with the main RTC
//! counter, then stopping RT0PS will stop RT1PS, but stopping RT1PS will not
//! stop RT0PS.
//!
//! \return None
//
//*****************************************************************************
void RTC_counterPrescaleHold (unsigned int baseAddress,
    unsigned char prescaleSelect)
{
    HWREGB(baseAddress + OFS_RTCPS0CTL_H + prescaleSelect) |= RT0PSHOLD_H;
}

//*****************************************************************************
//
//! Starts the selected Prescaler (RTC_A ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//! \param prescaleSelect is the prescaler to start.
//!        Valid values are
//!        \b RTC_PRESCALE_0
//!        \b RTC_PRESCALE_1
//!
//! This function starts the selected prescale counter. This function will only
//! work if the RTC is in counter mode.
//!
//! \return None
//
//*****************************************************************************
void RTC_counterPrescaleStart (unsigned int baseAddress,
    unsigned char prescaleSelect)
{
    HWREGB(baseAddress + OFS_RTCPS0CTL_H + prescaleSelect) &= ~(RT0PSHOLD_H);
}

//*****************************************************************************
//
//! Sets up an interrupt condition for the selected Prescaler.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param prescaleSelect is the prescaler to define an interrupt for.
//!        Valid values are
//!        \b RTC_PRESCALE_0
//!        \b RTC_PRESCALE_1
//! \param prescaleEventDivider is a divider to specify when an interrupt can
//!       occur based on the clock source of the selected prescaler.
//!       (Does not affect timer of the selected prescaler).
//!       Valid values are
//!       \b RTC_PSEVENTDIVIDER_2 [Default]
//!       \b RTC_PSEVENTDIVIDER_4
//!       \b RTC_PSEVENTDIVIDER_8
//!       \b RTC_PSEVENTDIVIDER_16
//!       \b RTC_PSEVENTDIVIDER_32
//!       \b RTC_PSEVENTDIVIDER_64
//!       \b RTC_PSEVENTDIVIDER_128
//!       \b RTC_PSEVENTDIVIDER_256
//!        Modified bits are \b RTxIP of \b RTCPSxCTL register.
//!
//! This function sets the condition for an interrupt to assert based on the
//! individual prescalers.
//!
//! \return None
//
//*****************************************************************************
void RTC_definePrescaleEvent (unsigned int baseAddress,
    unsigned char prescaleSelect,
    unsigned char prescaleEventDivider)
{
    HWREGB(baseAddress + OFS_RTCPS0CTL_L + prescaleSelect) &= ~(RT0IP_7);
    HWREGB(baseAddress + OFS_RTCPS0CTL_L +
        prescaleSelect) |= prescaleEventDivider;
}

//*****************************************************************************
//
//! Returns the selected Prescaler value.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param prescaleSelect is the prescaler to obtain the value of.
//!        Valid values are
//!        \b RTC_PRESCALE_0
//!        \b RTC_PRESCALE_1
//!
//! This function returns the value of the selected prescale counter register.
//! The counter should be held before reading. If in counter mode, the individual
//! prescaler can be held, while in Calendar mode the whole RTC must be held.
//!
//! \return The value of the specified Prescaler count register
//
//*****************************************************************************
unsigned char RTC_getPrescaleValue (unsigned int baseAddress,
    unsigned char prescaleSelect)
{
    if (HWREGB(baseAddress + OFS_RTCPS0CTL_H + prescaleSelect) & RT0PSHOLD_H){
        return ( 0) ;
    }

